>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. OLA-MUNDO.

PROCEDURE DIVISION.
    DISPLAY "Olá! Meu primeiro programa em COBOL usando GNUCobol."
    GOBACK.
