>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. CONTROLE-FLUXO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NOTA             PIC 9(2)V9 VALUE ZERO.
01 WS-CONTADOR         PIC 9 VALUE ZERO.

PROCEDURE DIVISION.
    PERFORM VARYING WS-CONTADOR FROM 1 BY 1 UNTIL WS-CONTADOR > 3
        DISPLAY "Digite a nota do aluno " WS-CONTADOR ": " WITH NO ADVANCING
        ACCEPT WS-NOTA
        EVALUATE TRUE
            WHEN WS-NOTA >= 7
                DISPLAY "Resultado: APROVADO"
            WHEN WS-NOTA >= 5
                DISPLAY "Resultado: RECUPERACAO"
            WHEN OTHER
                DISPLAY "Resultado: REPROVADO"
        END-EVALUATE
    END-PERFORM
    GOBACK.
