>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. TABELAS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NOTAS.
   05 WS-NOTA           PIC 9(2)V9 OCCURS 5 TIMES.
01 WS-INDICE            PIC 9 VALUE ZERO.
01 WS-SOMA              PIC 9(4)V9 VALUE ZERO.
01 WS-MEDIA             PIC 9(2)V99 VALUE ZERO.

PROCEDURE DIVISION.
    PERFORM VARYING WS-INDICE FROM 1 BY 1 UNTIL WS-INDICE > 5
        DISPLAY "Nota " WS-INDICE ": " WITH NO ADVANCING
        ACCEPT WS-NOTA(WS-INDICE)
        ADD WS-NOTA(WS-INDICE) TO WS-SOMA
    END-PERFORM

    COMPUTE WS-MEDIA = WS-SOMA / 5
    DISPLAY "Media da turma: " WS-MEDIA

    DISPLAY "Notas acima ou iguais a media:"
    PERFORM VARYING WS-INDICE FROM 1 BY 1 UNTIL WS-INDICE > 5
        IF WS-NOTA(WS-INDICE) >= WS-MEDIA
            DISPLAY "Aluno " WS-INDICE ": " WS-NOTA(WS-INDICE)
        END-IF
    END-PERFORM
    GOBACK.
