>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULAR-JUROS.

DATA DIVISION.
LINKAGE SECTION.
01 LK-CAPITAL            PIC 9(7)V99.
01 LK-TAXA               PIC 9(2)V999.
01 LK-MESES              PIC 9(3).
01 LK-MONTANTE           PIC 9(9)V99.
01 LK-JUROS              PIC 9(9)V99.

PROCEDURE DIVISION USING LK-CAPITAL LK-TAXA LK-MESES LK-MONTANTE LK-JUROS.
    COMPUTE LK-MONTANTE ROUNDED = LK-CAPITAL * (1 + LK-TAXA / 100) ** LK-MESES
    COMPUTE LK-JUROS = LK-MONTANTE - LK-CAPITAL
    GOBACK.
