>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULAR-DESCONTO.

DATA DIVISION.
LINKAGE SECTION.
01 LK-VALOR             PIC 9(5)V99.
01 LK-PERCENTUAL        PIC 9(2)V99.
01 LK-DESCONTO          PIC 9(5)V99.
01 LK-VALOR-FINAL       PIC 9(5)V99.

PROCEDURE DIVISION USING LK-VALOR LK-PERCENTUAL LK-DESCONTO LK-VALOR-FINAL.
    COMPUTE LK-DESCONTO = LK-VALOR * LK-PERCENTUAL / 100
    COMPUTE LK-VALOR-FINAL = LK-VALOR - LK-DESCONTO
    GOBACK.
